10/data/attachments/dbbb44a00bc4bd22.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_dc85437c-9bba-43d5-9f74-b4dffd5b443a</nif:username>
            <nif:friendToBeAdded>Kenneth_with_Friend_99920_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>